--- a/c09/c09b_fsm_revisited/readme.md
+++ b/c09/c09b_fsm_revisited/readme.md
@@ -292,16 +292,15 @@ Un astuce qui permet de simplifier la structure de l'application est de se faire
 Voici un exemple de schéma de machine à états finis.
 
-<!--
-@startuml
-scale 600 width
-
-[*] -> Arrêt
-Arrêt -> Fonctionne : Bouton\nactivé
-Fonctionne -> Arrêt : Bouton\ndésactivé
-
-@enduml
--->
+```mermaid
+---
+title: Machine à états finis
+---
+stateDiagram-v2
+    [*] --> Arrêt : Initialisation
+    Arrêt --> Fonctionne : Bouton désactivé
+    Fonctionne --> Arrêt : Bouton activé
+```
 
 On identifie deux états:
 - Arrêt
